app/controllers/api/v1/cabdrivers_controller.rb

SELECT "cabdrivers".* FROM "cabdrivers" WHERE "cabdrivers"."occupied" = ?  [["occupied", "false"]]
---
  def index
    @cabdrivers = Cabdriver.all
    #{}"4.6993083","74.1124884" ?latitude=4.664821&longitude=-74.0714571
    @cabdrivers = Cabdriver.reverse_geocoded_by(params[:latitude],params[:longitude]) if is_geo #(params[:latitude] && params[:longitude])

    if is_geo # (params[:latitude] && params[:longitude])

      @cabdrivers = Geocoder.search(params[:latitude] + "," + params[:longitude])[0].formatted_address

      #render json:  @locate

    end

    # Search
    @cabdrivers = @cabdrivers.search(params[:q]) if params[:q]

    # Filter for occupied
    @cabdrivers = @cabdrivers.occupied(params[:occupied]) if params[:occupied]

    # Order by
    @cabdrivers = @cabdrivers.order(params[:order].gsub(':', ' ')) if params[:order]