app/controllers/api/v1/cabdrivers_controller.rb

  def index
    @cabdrivers = Cabdriver.all

    # Search
    @cabdrivers = @cabdrivers.search(params[:q]) if params[:q]

    # Filter for state
    @cabdrivers = @cabdrivers.state(params[:state]) if params[:state]

    # Order by
    @cabdrivers = @cabdrivers.order(params[:order].gsub(':', ' ')) if params[:order]
---
SELECT "cabdrivers".* FROM "cabdrivers"
SELECT "cabdrivers".* FROM "cabdrivers" WHERE "cabdrivers"."state" = ?  [["state", "ocupado"]]

  def create
    @cabdriver = Cabdriver.new(cabdriver_params)

    if @cabdriver.save
---
INSERT INTO "cabdrivers" ("name", "cell", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jamr Guambita"], ["cell", "3133567878"], ["created_at", "2015-08-27 19:12:23.345567"], ["updated_at", "2015-08-27 19:12:23.345567"]]

  def destroy
    @cabdriver.destroy
---
DELETE FROM "cabdrivers" WHERE "cabdrivers"."id" = ?  [["id", 1]]

    def set_cabdriver
      @cabdriver = Cabdriver.find(params[:id])
---
SELECT  "cabdrivers".* FROM "cabdrivers" WHERE "cabdrivers"."id" = ? LIMIT 1  [["id", 1]]